app/views/books/show.html.erb

<% listings = @book.listings.where(status: true) %>
<% listings = listings.select{|listing| same_school?(listing.user, current_user)} %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 8]]