app/controllers/books_controller.rb

SELECT "books".* FROM "books"  ORDER BY "books"."title" ASC
SELECT "listings".* FROM "listings" WHERE "listings"."book_id" = ?  [["book_id", 1]]
SELECT  "books".* FROM "books"  ORDER BY "books"."title" ASC LIMIT 32
---
  def index
    if (params[:search])
      @books = Book.all.where("lower(title) LIKE ? OR lower(author) LIKE ?", "%#{params[:search]}%".downcase, "%#{params[:search]}%".downcase).order(:title)
    else
      @books = Book.all.order(:title)
    end
    temp = []
    @books.each do |book|
      book.listings.each do |listing|
        if SCHOOLS[listing.user.email.split("@")[1]] ==  SCHOOLS[current_user.email.split("@")[1]]
          temp.push book
          break
        end
      end
    end
    @books = temp
    @books = @books.first(32)

SELECT  "books".* FROM "books" WHERE "books"."isbn" = ? LIMIT 1  [["isbn", "9780596002145"]]
SELECT  1 AS one FROM "books" WHERE "books"."isbn" = '9780596002145' LIMIT 1
INSERT INTO "books" ("isbn", "title", "author", "image_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
INSERT INTO "reports" ("book_id", "user_id", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["book_id", 1], ["user_id", 2], ["text", "BOOK CREATED: Ruby In A Nutshell"], ["created_at", "2015-09-05 14:37:47.131723"], ["updated_at", "2015-09-05 14:37:47.131723"]]
---
   def create_sell
    book_hash = get_book(params[:isbn])
    if book_hash
      matches = Book.find_by_isbn(book_hash["isbn"])
      if matches.blank?
        @book = Book.new(isbn: book_hash["isbn"], title: title_upcase(book_hash["title"]), author: book_hash["authors_text"], image_url: book_hash["image"])
        if @book.save
          report = Report.create(book_id:@book.id, user_id: current_user.id, text:"BOOK CREATED: #{@book.title}")